; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v5 ?v10)
             (pred_9 ?v7 ?v13)
             (pred_6 ?v5 ?v13)
             (pred_1 ?v6 ?v5 )
	     (pred_3 ?v5)
             (pred_12 ?v3)
             (pred_11 ?v7)
             (pred_4 ?v13)
             (pred_5 ?v5)
             (pred_7 ?v7)
             (pred_8 ?v5)
             (pred_2 ))



(:action op_1
:parameters (?v11 ?v4 ?v12 ?v1)
:precondition (and (pred_12 ?v11) (pred_12 ?v4) (pred_11 ?v12) (pred_4 ?v1)
          (pred_10 ?v11 ?v4) (pred_9 ?v12 ?v1)
                   (pred_6 ?v4 ?v1) (pred_3 ?v11) 
                   (pred_5 ?v4) (pred_7 ?v12))
:effect (and  (pred_8 ?v4) (not (pred_5 ?v4))))


(:action op_5
:parameters (?v11 ?v8)
:precondition (and (pred_12 ?v11) (pred_12 ?v8)
               (pred_3 ?v11) (pred_10 ?v11 ?v8) (pred_8 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v11))))

(:action op_3
:parameters (?v11 ?v12)
:precondition (and (pred_12 ?v11) (pred_11 ?v12) 
                  (pred_3 ?v11) (pred_1 ?v12 ?v11) (pred_2 ))
:effect (and (pred_7 ?v12)
   (not (pred_1 ?v12 ?v11)) (not (pred_2 ))))


(:action op_4
:parameters (?v11 ?v9 ?v2)
:precondition (and (pred_12 ?v11) (pred_11 ?v9) (pred_11 ?v2)
                  (pred_3 ?v11) (pred_7 ?v2) (pred_1 ?v9 ?v11))
:effect (and (pred_7 ?v9) (pred_1 ?v2 ?v11)
        (not (pred_7 ?v2)) (not (pred_1 ?v9 ?v11))))

(:action op_2
:parameters (?v11 ?v12)
:precondition (and (pred_12 ?v11) (pred_11 ?v12) 
                  (pred_3 ?v11) (pred_7 ?v12))
:effect (and (pred_2 ) (pred_1 ?v12 ?v11) (not (pred_7 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_05 obj_01 obj_06 obj_12 obj_03 obj_07 obj_11 obj_08
    obj_10 obj_04
    obj_02 obj_09
    )

    (:init
       (pred_2)

       (pred_12 obj_13)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_06)
       (pred_12 obj_12)
       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_11)
       (pred_12 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_09)

       (pred_10 obj_13 obj_06)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_01)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_01 obj_05)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_03)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_03 obj_12)
       (pred_10 obj_07 obj_11)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_07)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_11)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_6  obj_03 obj_10)
       (pred_6  obj_01 obj_04)
       (pred_8 obj_13)
       (pred_8 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_12)
       (pred_8 obj_07)
       (pred_8 obj_11)
       (pred_8 obj_08)

       (pred_9  obj_02 obj_10)
       (pred_9  obj_09 obj_04)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_09 obj_07)
       (pred_3 obj_07)
    )

    (:goal (and
       (pred_1 obj_02 obj_11)
       (pred_1 obj_09 obj_11)
    ))
(:constraints
  (always (not (pred_3 obj_12)))
)
)

; plan
1. (op_3 obj_07 obj_09)
   deleted: (pred_1 obj_09 obj_07) (pred_2)
   added: (pred_7 obj_09)
   goals met: 0 of 2
2. (op_5 obj_07 obj_11)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_11)
   goals met: 0 of 2
3. (op_2 obj_11 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_2) (pred_1 obj_09 obj_11)
   goals met: 1 of 2
4. (op_5 obj_11 obj_07)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_07)
   goals met: 1 of 2
5. (op_5 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_06)
   goals met: 1 of 2
6. (op_5 obj_06 obj_13)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_13)
   goals met: 1 of 2
7. (op_3 obj_13 obj_02)
   deleted: (pred_1 obj_02 obj_13) (pred_2)
   added: (pred_7 obj_02)
   goals met: 1 of 2
8. (op_5 obj_13 obj_06)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_06)
   goals met: 1 of 2
9. (op_5 obj_06 obj_07)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_07)
   goals met: 1 of 2
10. (op_5 obj_07 obj_11)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_11)
   goals met: 1 of 2
11. (op_2 obj_11 obj_02)
   deleted: (pred_7 obj_02)
   added: (pred_2) (pred_1 obj_02 obj_11)
   goals met: 2 of 2
